<a href="https://colab.research.google.com/github/k4th4/Applied-Data-Science-with-Python-Specialization/blob/main/Pandas_scales.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [14]:
import pandas as pd

# Hereâ€™s an example. Lets create a dataframe of letter grades in descending order. We can also set an index
# value and here we'll just make it some human judgement of how good a student was, like "excellent" or "good"

df=pd.DataFrame(['A+', 'A', 'A-', 'B+', 'B', 'B-', 'C+', 'C', 'C-', 'D+', 'D', "E"],
                index=['excellent', 'excellent', 'excellent', 'good', 'good', 'good', 
                       'ok', 'ok', 'ok', 'poor', 'poor', "very poor"],
               columns=["Grades"])

In [15]:
df

          Grades
excellent     A+
excellent      A
excellent     A-
good          B+
good           B
good          B-
ok            C+
ok             C
ok            C-
poor          D+
poor           D
very poor      E

In [16]:
df["Grades"].astype("category").head()

excellent    A+
excellent     A
excellent    A-
good         B+
good          B
Name: Grades, dtype: category
Categories (12, object): ['A', 'A+', 'A-', 'B', ..., 'C-', 'D', 'D+', 'E']

In [34]:
#here is where the order happens
my_categories=pd.CategoricalDtype(categories=[ "D", 'D+', 'C-', 'C', 'C+', 'B-', 'B', 'B+', 'A-', 'A', 'A+'], 
                           ordered=True)
my_categories

CategoricalDtype(categories=['D', 'D+', 'C-', 'C', 'C+', 'B-', 'B', 'B+', 'A-', 'A',
                  'A+'],
                 ordered=True)

In [35]:
# E is not in the Category list, so as type category it is NaN

grades=df["Grades"].astype(my_categories)
grades

excellent     A+
excellent      A
excellent     A-
good          B+
good           B
good          B-
ok            C+
ok             C
ok            C-
poor          D+
poor           D
very poor    NaN
Name: Grades, dtype: category
Categories (11, object): ['D' < 'D+' < 'C-' < 'C' ... 'B+' < 'A-' < 'A' < 'A+']

In [39]:
#E doesnt show up in the list
grades[grades<"B-"]

ok      C+
ok       C
ok      C-
poor    D+
poor     D
Name: Grades, dtype: category
Categories (11, object): ['D' < 'D+' < 'C-' < 'C' ... 'B+' < 'A-' < 'A' < 'A+']

In [54]:
df.head()

   OrderDate   Region      Rep    Item  Units  UnitCost   Total
0   1/6/2020     East    Jones  Pencil     95      1.99  189.05
1  1/23/2020  Central   Kivell  Binder     50     19.99  999.50
2   2/9/2020  Central  Jardine  Pencil     36      4.99  179.64
3  2/26/2020  Central     Gill     Pen     27     19.99  539.73
4  3/15/2020     West  Sorvino  Pencil     56      2.99  167.44

In [76]:
# let's bring in numpy
import numpy as np

# Now we read in our dataset
df=pd.read_csv("/content/sample_data/sample dataset office.csv")

In [77]:
df.head()

   OrderDate   Region      Rep    Item  Units  UnitCost   Total
0   1/6/2020     East    Jones  Pencil     95      1.99  189.05
1  1/23/2020  Central   Kivell  Binder     50     19.99  999.50
2   2/9/2020  Central  Jardine  Pencil     36      4.99  179.64
3  2/26/2020  Central     Gill     Pen     27     19.99  539.73
4  3/15/2020     West  Sorvino  Pencil     56      2.99  167.44

In [78]:
#the total column was not foat, so we have to transform it to float
df['Total'] = df['Total'].astype(str).str.replace(",", "").astype(float)
df.head()

   OrderDate   Region      Rep    Item  Units  UnitCost   Total
0   1/6/2020     East    Jones  Pencil     95      1.99  189.05
1  1/23/2020  Central   Kivell  Binder     50     19.99  999.50
2   2/9/2020  Central  Jardine  Pencil     36      4.99  179.64
3  2/26/2020  Central     Gill     Pen     27     19.99  539.73
4  3/15/2020     West  Sorvino  Pencil     56      2.99  167.44

In [81]:
#total sales per Rep in the whole table
df_new=df.set_index('Rep').groupby(level=0)['Total'].agg(np.nansum)
df_new.head()

Rep
Andrews     438.37
Gill       1749.87
Howard      536.75
Jardine    2812.19
Jones      2363.04
Name: Total, dtype: float64

In [88]:
#bin the Reps in three different categories 
pd.cut(df_new, 3)

Rep
Andrews      (435.699, 1328.727]
Gill        (1328.727, 2219.083]
Howard       (435.699, 1328.727]
Jardine      (2219.083, 3109.44]
Jones        (2219.083, 3109.44]
Kivell       (2219.083, 3109.44]
Morgan      (1328.727, 2219.083]
Parent       (2219.083, 3109.44]
Smith       (1328.727, 2219.083]
Sorvino      (435.699, 1328.727]
Thompson     (435.699, 1328.727]
Name: Total, dtype: category
Categories (3, interval[float64]): [(435.699, 1328.727] < (1328.727, 2219.083] < (2219.083, 3109.44]]

In [87]:
#bin the Reps in three different categories and label them as low, medium and high
pd.cut(df_new, 3, labels=["low", "medium", "high"])

Rep
Andrews        low
Gill        medium
Howard         low
Jardine       high
Jones         high
Kivell        high
Morgan      medium
Parent        high
Smith       medium
Sorvino        low
Thompson       low
Name: Total, dtype: category
Categories (3, object): ['low' < 'medium' < 'high']